# 정수를 입력을 받습니다.
# 입력 받은 문자열을 정수로 바꿉니다.

# 문자열로 변환


#######################################
# 방법1. 문자열을 사용하는 방법
# 방법2. 나머지를 사용하는 방법
#######################################

#######################################
# 방법1. 문자열을 사용하는 방법
#######################################
# 마지막 자리 숫자를 추출
sum = input("정수를 입력하세요")
# 숫자로 변환하기
sum = int(sum)
# 짝수 확인
if sum%2 == 0 :
    print("짝수입니다")
# 홀수 확인
else :
    print("홀수입니다")
# 숫자로 변환하기
#######################################
# 방법2. 나머지를 사용하는 방법
#######################################

# 짝수 조건

# 홀수 조건
